{
"_name_or_path": "facebook/opt-2.7b",
"weight_path": "/home/hao/opt_weights/2.7B_np",
"_remove_final_layer_norm": false,
"activation_dropout": 0,
"activation_function": "relu",
"architectures": [
"OPTForCausalLM"
],
"attention_dropout": 0,
"bos_token_id": 2,
"do_layer_norm_before": true,
"dropout": 0.1,
"eos_token_id": 2,
"ffn_dim": 10240,
"hidden_size": 2560,
"init_std": 0.02,
"layerdrop": 0,
"max_position_embeddings": 2048,
"model_type": "opt",
"num_attention_heads": 32,
"num_hidden_layers": 32,
"pad_token_id": 1,
"prefix": "</s>",
"torch_dtype": "float16",
"transformers_version": "4.21.0.dev0",
"use_cache": true,
"vocab_size": 50272,
"word_embed_proj_dim": 2560
}
